Repository: Jarrey/MagicLockScreen
Catalog: src/MagicLockScreen/Resources/*/Resources.resw
Source language: en
Languages: fr, zh_hans, zh_hant

# appDescription
source: Chameleon (Magic LockScreen) provides the picture of the day service. It synchronizes the network as well as local picture gallery, and randomly set one of the pictures as the lock screen background at regular intervals.
fr: Caméléon (Magical LockScreen) est un service de télécharger un image via l'internet à chaque jour. Il est mettre à jour les images en ligne et en locale. Vous pouvez aussi le configurer pour choisir un image aléatoirement comme votre écran de Verrouillage!
zh_hans: 百变锁屏 (Chameleon) 是一款提供网络每日一图查看服务,能够同步更新网络以及本地图片库图片,并隔一定时间自动随机将一幅图片其设置为系统锁屏背景。
zh_hant: 百變鎖屏 (Chameleon) 是一款提供網路每日一圖查看服務,能夠同步更新網路以及本地圖片庫圖片,並隔一定時間自動隨機將一幅圖片其設置為系統鎖屏背景。

# appDisplayName
source: Chameleon
fr: Caméléon
zh_hans: 百变锁屏
zh_hant: 百變鎖屏

# AppName.Text
source: Chameleon
fr: Caméléon
zh_hans: 百变锁屏
zh_hant: 百變鎖屏

# appShortName
source: Chameleon
fr: Caméléon
zh_hans: 百变锁屏
zh_hant: 百變鎖屏

# packageDisplayName
source: Chameleon
fr: Caméléon
zh_hans: 百变锁屏
zh_hant: 百變鎖屏

# DownloadingLabel.Text
source: Downloading:
fr: Téléchargement:
zh_hans: 正在下载:
zh_hant: 正在下載:

# ExplanationTextLabel.Title
source: Explanation:
fr: A Propos:
zh_hans: 介绍:
zh_hant: 介紹:

# OriginalSiteUrlLabel.Text
source: For more, please visit:
fr: Pour en savoir plus,veillez visiter:
zh_hans: 了解更多, 请访问:
zh_hant: 了解更多, 請訪問:

# CopyrightLabel.Text
source: Copyright:
zh_hans: 版权所有:
zh_hant: 版權所有:

# DescriptionTextLabel.Title
source: Description:
fr: A Propos:
zh_hans: 介绍:
zh_hant: 介紹:

# SummaryTextLabel.Title
source: Summary:
fr: Résumé:
zh_hans: 介绍:
zh_hant: 介紹:

# InfoButton.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Info
zh_hans: 信息
zh_hant: 信息

# InformationTitle
source: Information
zh_hans: 信息
zh_hant: 信息

# PrimaryInformation
source: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock Foreground="Red" FontWeight="Bold">Note: The automatic changement of the lock screen DOESN'T WORK in an inactivated Windows 8.1 , please check your Windows activation status before leaving us a unsatisfied note.</TextBlock> <TextBlock>Chameleon v3.0 started to support change Windows desktop wallpaper. </TextBlock> <Grid> <HyperlinkButton Grid.Column="1" Content="Download ChameDesk Desktop Service" VerticalAlignment="Center" NavigateUri="http://chameapp.azurewebsites.net/chamedesk/chamedesk_setup.exe"/> </Grid> <TextBlock>Chameleon (Magic LockScreen) provides the Picture of the day service. It synchronizes the network as well as local picture gallery, and randomly set one of the pictures as the lock screen background at regular intervals.</TextBlock> <TextBlock>Photo of the Day services include:</TextBlock> <HyperlinkButton Content="NASA Astronomy Picture of the Day " NavigateUri="http://apod.nasa.gov/apod/"/> <HyperlinkButton Content="Bing picture of the day" NavigateUri="http://www.bing.com/"/> <HyperlinkButton Content="Flickr Interestingness Pictures" NavigateUri="http://www.flickr.com/explore/interesting/"/> <HyperlinkButton Content="InterfaceLIFT HD Wallpaper" NavigateUri="http://interfacelift.com/"/> <!--<HyperlinkButton Content="Google Picasa Public Images" NavigateUri="https://picasaweb.google.com/"/>--> <HyperlinkButton Content="Lunar Picture of the Day" NavigateUri="http://lpod.wikispaces.com/"/> <!--<HyperlinkButton Content="Ocean Picture of the Day" NavigateUri="http://theoceanproject.org/opod/index.php"/>--> <HyperlinkButton Content="Wikipedia picture of the Day" NavigateUri="http://commons.wikimedia.org/wiki/Commons:Picture_of_the_day"/> <HyperlinkButton Content="National Geographic magazine picture of the Day" NavigateUri="http://photography.nationalgeographic.com/"/> <HyperlinkButton Content="Microsoft® Desktop backgrounds" NavigateUri="http://windows.microsoft.com/en-us/windows/wallpaper"/> <HyperlinkButton Content="WWF© Photos" NavigateUri="http://worldwildlife.org/media?filter=photos"/> <TextBlock>Besides,it enables to browse the local picture gallery and set them as lock screen background</TextBlock> <TextBlock> All images are from free public network services, and are copyright to their respective owners. Chameleon get images from internet, and consider the owner of the pictures has already permitted the corresponding website picture sharing disclosure agreement. Any individuals and organizations shall not use these images for commercial purposes, and any legal issues arises from unauthorized use of the images could be investigated for legal responsibility by the copyright holders in accordance with local laws.</TextBlock> <TextBlock>please pay attention to the introduction when view the pictures, should you have any queries, please contact the author at: jar.bob@gmail.com</TextBlock> <TextBlock FontWeight="Bold">Chameleon Series:</TextBlock> <Grid> <Grid.ColumnDefinitions> <ColumnDefinition Width="auto"/> <ColumnDefinition Width="*"/> </Grid.ColumnDefinitions> <Image Source="ms-appx:///MagicLockScreen_UI/Assets/ChameHOTLogo.png"/> <HyperlinkButton Grid.Column="1" Content="Download Chameleon - On This Day" VerticalAlignment="Center" NavigateUri="http://apps.microsoft.com/windows/app/chameleon-on-this-day/513a0951-1c08-485d-80d4-2a06832dbd83"/> </Grid> </StackPanel>
fr: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock Foreground="Red" FontWeight="Bold">Attention: Le changement automatique de l'écran de verrouillage NE FONCTIONNE PAS dans un Windows 8 non-activé, merci de vérifier votre situation d'activation de Windows avant de nous laisser une note injuste.</TextBlock> <TextBlock>Caméléon (Magical LockScreen) est un service de télécharger un image via l'internet à chaque jour. Il est mettre à jour les images en ligne et en locale. Vous pouvez aussi le configurer pour choisir un image aléatoirement comme votre écran de Verrouillage!</TextBlock> <TextBlock>Le service d'image en ligne quotidien inclus:</TextBlock> <HyperlinkButton Content="NASA L'astronomie du jour" NavigateUri="http://apod.nasa.gov/apod/"/> <HyperlinkButton Content="Bing fonds d'écran du jour" NavigateUri="http://www.bing.com/"/> <HyperlinkButton Content="Flickr intéressant" NavigateUri="http://www.flickr.com/explore/interesting/"/> <HyperlinkButton Content="InterfaceLIFT HD Wallpager" NavigateUri="http://interfacelift.com/"/> <!--<HyperlinkButton Content="Google Picasa Image Public" NavigateUri="https://picasaweb.google.com/"/>--> <HyperlinkButton Content="Lunar Image du jour" NavigateUri="http://lpod.wikispaces.com/"/> <HyperlinkButton Content="Océans du jour" NavigateUri="http://theoceanproject.org/opod/index.php"/> <HyperlinkButton Content="Wikipedia du jour" NavigateUri="http://commons.wikimedia.org/wiki/Commons:Picture_of_the_day"/> <HyperlinkButton Content="National Geographic du jour" NavigateUri="http://photography.nationalgeographic.com/"/> <TextBlock>Il support aussi parcourir les images en locale et les choisir comme votre écran de Verrouillage!</TextBlock> <TextBlock>Toutes les photos sont fournis par les service gratuits du réseau public，Toutes les images copyright appartient à des propriétaires des images，L'application obtiens ces images via internet, considérant que l'image est déjà autorisés pour le partage.Toute personne ne pourra utiliser ces images à des buts commerciales.Questions juridiques découlant de toute utilisation non autorisée, par les images des détenteurs de copyright, conformément aux lois locales et de poursuivre leurs responsabilités légales.</TextBlock> <TextBlock>Pour toutes les questions, merci à contacter l'author: jar.bob@gmail.com</TextBlock> </StackPanel>
zh_hans: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock Foreground="Red" FontWeight="Bold">注: 自动更换锁屏功能在未激活的Windows 8.1上无法工作，请及时检查你的Windows 8.1的激活状态。</TextBlock> <Grid> <HyperlinkButton Grid.Column="1" Content="下载 ChameDesk 桌面服务程序" VerticalAlignment="Center" NavigateUri="http://chameapp.azurewebsites.net/chamedesk/chamedesk_setup.exe"/> </Grid> <TextBlock>百变锁屏(Chameleon) v3.0支持修改桌面壁纸。</TextBlock> <TextBlock>Chameleon(百变锁屏)是一款提供网络每日一图查看,分享服务,能够同步更新网络以及本地图片库图片,并隔一定时间自动随机将一幅图片其设置为系统锁屏背景。</TextBlock> <TextBlock>网络每日一图查看服务主要包括:</TextBlock> <HyperlinkButton Content="NASA 天文每日一图" NavigateUri="http://apod.nasa.gov/apod/"/> <HyperlinkButton Content="必应首页每日一图" NavigateUri="http://www.bing.com/"/> <HyperlinkButton Content="Flickr 趣图" NavigateUri="http://www.flickr.com/explore/interesting/"/> <HyperlinkButton Content="InterfaceLIFT 高清壁纸" NavigateUri="http://interfacelift.com/"/> <!--<HyperlinkButton Content="Google Picasa 公共图片" NavigateUri="https://picasaweb.google.com/"/>--> <HyperlinkButton Content="Lunar 每日一图" NavigateUri="http://lpod.wikispaces.com/"/> <!--<HyperlinkButton Content="海洋每日一图" NavigateUri="http://theoceanproject.org/opod/index.php"/>--> <HyperlinkButton Content="维基百科每日一图" NavigateUri="http://commons.wikimedia.org/wiki/Commons:Picture_of_the_day"/> <HyperlinkButton Content="国家地理杂志每日一图" NavigateUri="http://photography.nationalgeographic.com/"/> <HyperlinkButton Content="Microsoft®桌面背景" NavigateUri="http://windows.microsoft.com/en-us/windows/wallpaper"/> <HyperlinkButton Content="WWF© 美图" NavigateUri="http://worldwildlife.org/media?filter=photos"/> <TextBlock>此外还支持本地图片库浏览，并使用图片库图片设置为锁屏背景。</TextBlock> <TextBlock>所有图片提供服务均为免费公开的网络服务，所有图片版权归属于图片所有者，本应用从网络获取这些图片，认为图片作者已经许可了对应网站的图片分享公开协议。任何人员均不得利用这些图片用于商业目的，任何无授权使用产生的法律问题，可由图片版权所有人根据当地法律追究法律责任。</TextBlock> <TextBlock>请注意浏览图片时的介绍以及版权信息，任何疑问可联系应用作者: jar.bob@gmail.com</TextBlock> <TextBlock FontWeight="Bold">Chameleon系列:</TextBlock> <Grid> <Grid.ColumnDefinitions> <ColumnDefinition Width="auto"/> <ColumnDefinition Width="*"/> </Grid.ColumnDefinitions> <Image Source="ms-appx:///Assets/ChameHOTLogo.png"/> <HyperlinkButton Grid.Column="1" Content="下载Chameleon - 历史上的今天" VerticalAlignment="Center" NavigateUri="http://apps.microsoft.com/windows/app/chameleon-on-this-day/513a0951-1c08-485d-80d4-2a06832dbd83"/> </Grid> </StackPanel>
zh_hant: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock Foreground="Red" FontWeight="Bold">註: 自動更換鎖屏功能在未激活的Windows 8上無法工作，請及時檢查你的Windows 8的激活狀態。</TextBlock> <TextBlock>Chameleon(百變鎖屏)是一款提供網絡每日一圖查看,分享服務,能夠同步更新網絡以及本地圖片庫圖片,並隔一定時間自動隨機將一幅圖片其設置為系統鎖屏背景。</TextBlock> <TextBlock>網絡每日一圖查看服務主要包括:</TextBlock> <HyperlinkButton Content="NASA 天文每日一圖" NavigateUri="http://apod.nasa.gov/apod/"/> <HyperlinkButton Content="必應首頁每日一圖" NavigateUri="http://www.bing.com/"/> <HyperlinkButton Content="Flickr 趣圖" NavigateUri="http://www.flickr.com/explore/interesting/"/> <HyperlinkButton Content="InterfaceLIFT 高清壁紙" NavigateUri="http://interfacelift.com/"/> <!--<HyperlinkButton Content="Google Picasa 公共圖片" NavigateUri="https://picasaweb.google.com/"/>--> <HyperlinkButton Content="Lunar 每日一圖" NavigateUri="http://lpod.wikispaces.com/"/> <HyperlinkButton Content="海洋每日一圖" NavigateUri="http://theoceanproject.org/opod/index.php"/> <HyperlinkButton Content="維基百科每日一圖" NavigateUri="http://commons.wikimedia.org/wiki/Commons:Picture_of_the_day"/> <HyperlinkButton Content="國家地理雜誌每日一圖" NavigateUri="http://photography.nationalgeographic.com/"/> <TextBlock>此外還支持本地圖片庫瀏覽，並使用圖片庫圖片設置為鎖屏背景。</TextBlock> <TextBlock>所有圖片提供服務均為免費公開的網絡服務，所有圖片版權歸屬於圖片所有者，本程式從網絡獲取這些圖片，認為圖片作者已經許可了對應網站的圖片分享公開協議。任何人員均不得利用這些圖片用於商業目的，任何無授權使用產生的法律問題，可由圖片版權所有人根據當地法律追究法律責任。</TextBlock> <TextBlock>請註意瀏覽圖片時的介紹以及版權信息，任何疑問可聯系程式作者: jar.bob@gmail.com</TextBlock> </StackPanel>

# About
source: About Application
fr: A propos
zh_hans: 关于应用
zh_hant: 關於程式

source: Setting
fr: Paramètrer
zh_hans: 设置
zh_hant: 設置

# SettingButton.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Settings
fr: Paramètres
zh_hans: 设置
zh_hant: 設置

source: Help
fr: Aide
zh_hans: 帮助
zh_hant: 幫助

# HelpButton.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Help
fr: Aide
zh_hans: 帮助
zh_hant: 幫助

source: Privacy Policy
fr: Politique de confidentialité
zh_hans: 隐私策略
zh_hant: 隱私策略

# PrivacyPolicyContent
source: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock>Chameleon(Magical Lockscreen) does not collect, store or release any of your personal information or information related to your devices. Chameleon(Magical Lockscreen) does not collect any statistical or analytical data, but also does not track user behavior.</TextBlock> <TextBlock>Any needs of changing the privacy policy of Chameleon(Magical LockScreen), the author will update the changes at settings page, so that you will always know what information this application collects. Should you have any questions or concerns towards this privacy policy, please contact the author via jar.bob@gmail.com.</TextBlock> </StackPanel>
fr: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock>Caméléon (Magical Lockscreen) ne recueillir, stocker ou délivrer aucun de vos informations personnels ou des données liés à vos appareils. Caméléon (Magical Lockscreen) ni recueille des données statistiques ou analytiques, ni suivre le comportement de l'utilisateur.</TextBlock> <TextBlock>En tous nécessités de modification de la politique confidentialité de Caméléon (Magical LockScreen), l'auteur mettra à jour les modifications dans la page paramètrage, pour que vous sachiez toujours quelles informations cette application recueille. Si vous avez des questions ou des soucis liés à cette politique de confidentialité, vous pouvez toujours contacter l'auteur via jar.bob@gmail.com</TextBlock> </StackPanel>
zh_hans: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock>本应用不会收集、存储、发布您的任何个人信息或者与您的设备相关的信息。 本应用不会收集任何统计数据和分析数据，也不会跟踪用户的行为。</TextBlock> <TextBlock>如果需要改变本应用的隐私策略，我会将相关的改动在此设置页面发布，以便您能随时了解本应用会收集什么信息。 任何时候如果您对此隐私策略有疑问，请通过电子邮件 jar.bob@gmail.com 和我联系。</TextBlock> </StackPanel>
zh_hant: <StackPanel xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"> <StackPanel.Resources> <Style TargetType="TextBlock"> <Setter Property="Margin" Value="0,8,0,8"/> <Setter Property="TextWrapping" Value="Wrap"/> </Style> </StackPanel.Resources> <TextBlock>本應用不會收集、存儲、發布您的任何個人信息或者與您的設備相關的信息。 本應用不會收集任何統計數據和分析數據，也不會跟蹤用戶的行為。</TextBlock> <TextBlock>如果需要改變本應用的隱私策略，我會將相關的改動在此設置頁面發布，以便您能隨時了解本應用會收集什麽信息。 任何時候如果您對此隱私策略有疑問，請通過電子郵件 jar.bob@gmail.com 和我聯系。</TextBlock> </StackPanel>

# InvalidImage.Text
source: Invalid image
fr: L'image est invalide
zh_hans: 无效图片
zh_hant: 無效圖片

# RefreshButton.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Refresh
fr: Actualiser
zh_hans: 刷新
zh_hant: 刷新

# AppName.FontFamily
source: Jokerman
zh_hans: Microsoft YaHei UI
zh_hant: Segoe UI

# PageLogo.Source
source: Assets/AppTitle.en.png
fr: Assets/AppTitle.fr.png
zh_hans: Assets/AppTitle.zh-hans.png
zh_hant: Assets/AppTitle.zh-hant.png

# HelpPage1
source: Assets/Help/HelpPage1.en.jpg
fr: Assets/Help/HelpPage1.fr.jpg
zh_hans: Assets/Help/HelpPage1.zh-hans.jpg
zh_hant: Assets/Help/HelpPage1.zh-hant.jpg

# HelpPage2
source: Assets/Help/HelpPage2.en.jpg
fr: Assets/Help/HelpPage2.fr.jpg
zh_hans: Assets/Help/HelpPage2.zh-hans.jpg
zh_hant: Assets/Help/HelpPage2.zh-hant.jpg

# HelpPage3
source: Assets/Help/HelpPage3.en.jpg
fr: Assets/Help/HelpPage3.fr.jpg
zh_hans: Assets/Help/HelpPage3.zh-hans.jpg
zh_hant: Assets/Help/HelpPage3.zh-hant.jpg

# CloseButton.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Close
fr: Fermer
zh_hans: 关闭
zh_hant: 關閉

# UpgradePrompt
source: Settings were reset, please re-config your automatic lock screen changement settings
fr: Cette mise à jour a réinitialisé les paramètres de la tâche de fond, merci de réconfiguer vos paramètres de changement automatique de l'écran de verrouillage
zh_hans: 设置被重置，请重新设置你的自动更换锁屏功能
zh_hant: 此次升級重置了後臺任務設置，請重新設置你的自動更換鎖屏功能

# GetItLabel.Text
source: Get it now:
fr: Télécharger
zh_hans: 立刻获取:
zh_hant: 立刻獲取:
